1. 모든 사원의 모든 정보를 조회한다.
2. 부서가 없는 사원의 모든 정보를 조회한다.
3. 직무가 없는 사원의 모든 정보를 조회한다.
4. 부서와 직무가 모두 있는 사원의 모든 정보를 조회한다.
5. 부서장이 없는 모든 부서의 모든 정보를 조회한다.
6. 부서장이 있는 모든 부서의 모든 정보를 조회한다.
7. 부서장의 모든 사원 정보를 조회한다.
8. 사원의 이름만 조회한다.
9. 사원의 이름이 7자리인 사원의 모든 정보를 조회한다.
10. 사원의 이메일이 6자리인 사원의 모든 정보를 조회한다.
11. 모든 지역의 모든 정보를 조회한다.
12. 지역이 없는 모든 부서의 정보를 조회한다.
13. 지역이 있는 모든 부서의 정보와 도시 정보를 조회한다.
14. 모든 사원의 모든 정보와 부서명을 조회한다.
15. 111번 사원의 모든 정보와 부서명을 조회한다.
16. 115번의 사원의 모든 정보와 부서명, 직무명을 조회한다.
17. 100번 사원의 모든 정보와 부서명, 직무명, 도시명을 조회한다.
18. 부서아이디별 사원의 평균연봉을 조회한다.
19. 직무아이디별 사원의 최고연봉을 조회한다.
20. 부서명별 사원의 수를 조회한다.
21. 직무명별 사원의 평균연봉을 조회한다.
22. 부서명, 직무명별 사원의 수와 평균연봉을 조회한다.
23. 인센티브를 안받는 사원의 모든 정보를 조회한다.
24. 인센티브를 받는 사원의 부서아이디를 중복없이 조회한다.
25. 인센티브를 받는 사원의 직무아이디를 중복없이 조회한다.
26. 사원이 있는 부서의 지역아이디를 조회한다.
27. 사원이 없는 부서의 부서명을 조회한다.
28. 지역별 부서의 수를 조회한다. (부서가 없으면 부서의 수는 0으로 조회한다.)
29. 지역별 사원의 평균연봉을 조회한다. (사원이 없으면 평균연봉은 0으로 조회한다.)
30. Seattle의 부서 아이디를 조회한다.
31. Seattle에서 근무중인 사원의 모든 직무명을 중복없이 조회한다.
32. 사원이 한명도 없는 도시를 조회한다.
33. 사원이 한명이라도 있는 도시를 조회한다.
34. 모든 사원의 정보를 연봉으로 오름차순 정렬하여 조회한다.
35. 부서명별 평균연봉을 부서명으로 내림차순 정렬하여 조회한다.
36. 부서명별 최고연봉을 최고연봉으로 오름차순 정렬하여 조회한다.
37. 부서명이 가장 긴 부서에서 근무중인 사원의 모든 정보를 조회한다.
38. 도시명 별 사원의 수를 도시명으로 오름차순 정렬하여 조회한다.
39. 모든 사원의 사원번호, 이름, 성, 연봉, 인센티브를 포함한 연봉 정보를 조회한다.
40. 매년 10%의 상여금을 받는다고 했을 때, 사원별로 현재까지 받은 상여금의 합과 사원번호, 연봉을 조회한다.
41. 직무가 변경되었던 사원들의 모든 정보를 조회한다.
42. 모든 사원들의 현재 직무명과 과거의 직무명을 조회한다. 만약 직무가 한번도 변경되지 않았다면, 과거의 직무명은 '없음' 으로 조회한다.
43. 직무가 변경될 때마다 연봉이 15% 감소한다고 했을 때, 직무가 변경된 사원들의 감소된 연봉을 조회한다.
44. 2003년에 입사한 사원은 몇 명인지 조회한다.
45. 2002년부터 2006년까지 입사한 사원은 몇명인지 연도별로 조회한다.
46. 113번 사원의 상사의 모든 정보를 조회한다.
47. 100번 사원의 모든 부하직원을 계층조회한다.
48. 113번 사원의 모든 상사를 계증조회한다.
49. IT 부서장의 모든 부하직원을 계층조회한다.
50. 모든 부서의 부서장들의 부하직원을 계층조회한다.
